samspencer5991/esp32-manager/Src/midi_handling.cpp
//-------------- FreeRTOS Tasks --------------//
void midi_ProcessTask(void* parameter)
{
	//UBaseType_t uxHighWaterMark;
	while(1)
	{
		midi_ReadAll();
		//uxHighWaterMark = uxTaskGetStackHighWaterMark( NULL );
		//ESP_LOGD(TAG, "MIDI Process Task High Water Mark: %d", uxHighWaterMark);
		vTaskDelay(2);
	}
}

// RTOS Tasks
void midi_BleInfoTask(void* parameter)
{
	static uint16_t bleProcessCount = 0;
	//UBaseType_t uxHighWaterMark;
	while(1)
	{
		if(esp32ConfigPtr->wirelessType != Esp32BLE)
		{
			vTaskDelay(1000 / portTICK_PERIOD_MS);
			continue;
		}
		else
		{
			//uxHighWaterMark = uxTaskGetStackHighWaterMark( NULL );
			//ESP_LOGI(WIFI_TAG, "WiFi Process Task High Water Mark: %d", uxHighWaterMark);
			vTaskDelay(10 / portTICK_PERIOD_MS);
			bleProcessCount++;
			if(bleProcessCount >= 250)
			{
				//wifi_UpdateInfoTask();
				bleProcessCount = 0;
			}
		}
	}
}

//-------------- Global Function Definitions --------------//
void midi_Init()
{
	ESP_LOGD(TAG, "Wireless mode: %d", esp32ConfigPtr->wirelessType);
	ESP_LOGD(TAG, "BLE mode: %d", esp32ConfigPtr->bleMode);
	// General MIDI callback assignment
	// USBD
#ifdef USE_USBD_MIDI
	numMidiHandles++;
	usbdMidi.setHandleControlChange(usbdMidi_ControlChangeCallback);
	usbdMidi.setHandleProgramChange(usbdMidi_ProgramChangeCallback);
	usbdMidi.setHandleSystemExclusive(usbdMidi_SysexCallback);
#endif

	// USBH
#ifdef USE_USBH_MIDI
	numMidiHandles++;
	//midih_Init();
#endif

	// BLE
#ifdef USE_BLE_MIDI
	numMidiHandles++;
	// Server
	blueMidi.setHandleControlChange(blueMidi_ControlChangeCallback);
	blueMidi.setHandleProgramChange(blueMidi_ProgramChangeCallback);
	blueMidi.setHandleSystemExclusive(blueMidi_SysexCallback);

	BLEblueMidi.setHandleConnected(blueMidi_OnConnected);
	BLEblueMidi.setHandleDisconnected(blueMidi_OnDisconnected);

	// Client
#ifdef USE_BLE_MIDI_CLIENT
	BLEblueMidiClient.setHandleConnected([]()
		{
			Serial.println("---------CONNECTED---------");
		});

	BLEblueMidiClient.setHandleDisconnected([]()
		{
			Serial.println("---------NOT CONNECTED---------");
		});
#endif
#endif

	// WiFi RTP (Apple MIDI)
#ifdef USE_WIFI_RTP_MIDI
	numMidiHandles++;		
	RTP.setHandleConnected([](const APPLEMIDI_NAMESPACE::ssrc_t & ssrc, const char* name) {
    rtpIsConnected++;
	 Serial.println("Connected to session");
    //Serial.printf("Connected to session %s %s", ssrc, name);
  });
  RTP.setHandleDisconnected([](const APPLEMIDI_NAMESPACE::ssrc_t & ssrc) {
    rtpIsConnected--;
    Serial.printf("Disconnected %s", ssrc);
  });
  
  rtpMidi.setHandleNoteOn([](byte channel, byte note, byte velocity) {
    Serial.printf("NoteOn %d", note);
  });
  rtpMidi.setHandleNoteOff([](byte channel, byte note, byte velocity) {
    Serial.printf("NoteOff %d", note);
  });
#endif

	// Serial0
#ifdef USE_SERIAL0_MIDI
  	numMidiHandles++;
	serial0Midi.setHandleControlChange(serial0Midi_ControlChangeCallback);
	serial0Midi.setHandleProgramChange(serial0Midi_ProgramChangeCallback);
	serial0Midi.setHandleSystemExclusive(serial0Midi_SysexCallback);
#endif

	// Serial1
#ifdef USE_SERIAL1_MIDI
	numMidiHandles++;		
	serial1Midi.setHandleControlChange(serial1Midi_ControlChangeCallback);
	serial1Midi.setHandleProgramChange(serial1Midi_ProgramChangeCallback);
	serial1Midi.setHandleSystemExclusive(serial1Midi_SysexCallback);
#endif

	// Serial2
#ifdef USE_SERIAL2_MIDI
	numMidiHandles++;
	serial2Midi.setHandleControlChange(serial2Midi_ControlChangeCallback);
	serial2Midi.setHandleProgramChange(serial2Midi_ProgramChangeCallback);
	serial2Midi.setHandleSystemExclusive(serial2Midi_SysexCallback);
#endif

	// Begin MIDI interfaces
		// USBD
	// BLE
#ifdef USE_BLE_MIDI
	if(esp32ConfigPtr->wirelessType == Esp32BLE)
	{
		if(esp32ConfigPtr->bleMode == Esp32BLEServer)
		{
			ESP_LOGV(TAG, "Starting BLE MIDI Server");
			blueMidi.begin(MIDI_CHANNEL_OMNI);
		}
#ifdef USE_BLE_MIDI_CLIENT
		else if(esp32ConfigPtr->bleMode == Esp32BLEClient)
		{
			ESP_LOGV(TAG, "Starting BLE MIDI Central");
			blueMidiClient.begin(MIDI_CHANNEL_OMNI);
		}
#endif
		
	}
#endif
	// Serial0
#ifdef USE_SERIAL0_MIDI
	ESP_LOGV(TAG, "Starting Serial0 MIDI");
	serial0Midi.begin(MIDI_CHANNEL_OMNI);
#endif
	// Serial1
#ifdef USE_SERIAL1_MIDI
	ESP_LOGV(TAG, "Starting Serial1 MIDI");
	serial1Midi.begin(MIDI_CHANNEL_OMNI);
#endif
	// Serial2
#ifdef USE_SERIAL2_MIDI
	ESP_LOGV(TAG, "Starting Serial2 MIDI");
	serial2Midi.begin(MIDI_CHANNEL_OMNI);
#endif

	midi_ApplyThruSettings();

}

void midi_ApplyThruSettings()
{
	// Apply MIDI thru settings
	// USBD
#ifdef USE_USBD_MIDI
	if(usbdMidiThruHandlesPtr[MidiUSBD])
		usbdMidi.turnThruOn();
	else
		usbdMidi.turnThruOff();
#endif
	// USBH
#ifdef USE_USBH_MIDI	
	if(usbhMidiThruHandlesPtr[MidiUSBH])
		usbhMidi.turnThruOn();
	else
		usbhMidi.turnThruOff();
#endif
	// BLE
#ifdef USE_BLE_MIDI
	if(bleMidiThruHandlesPtr[MidiBLE])
		blueMidi.turnThruOn();
	else
		blueMidi.turnThruOff();
#endif
	// WiFi
#ifdef USE_WIFI_RTP_MIDI
	if(wifiMidiThruHandlesPtr[MidiWiFiRTP])
		rtpMidi.turnThruOn();
	else
		rtpMidi.turnThruOff();
#endif
	// Serial0
#ifdef USE_SERIAL0_MIDI
	if(serial0MidiThruHandlesPtr[MidiSerial0])
		serial0Midi.turnThruOn();
	else 
		serial0Midi.turnThruOff();
#endif
	// Serial1
#ifdef USE_SERIAL1_MIDI
	if(serial1MidiThruHandlesPtr[MidiSerial1])
		serial1Midi.turnThruOn();
	else
		serial1Midi.turnThruOff();
#endif
	// Serial2
#ifdef USE_SERIAL2_MIDI
	if(serial2MidiThruHandlesPtr[MidiSerial2])
		serial2Midi.turnThruOn();
	else
		serial2Midi.turnThruOff();
#endif
}

// USBD MIDI must be initialised as soon as possible after boot
#ifdef USE_USBD_MIDI
void midi_InitUSBD()
{
	ESP_LOGV(TAG, "Starting USBD MIDI");
	usbdMidi.begin(MIDI_CHANNEL_OMNI);
	usbdMidi.turnThruOff();
}
#endif

// WiFi RTP must be initialised after WiFi is connected
#ifdef USE_WIFI_RTP_MIDI
void midi_InitWiFiRTP()
{
	if(esp32ConfigPtr->wirelessType != Esp32WiFi)
	{
		ESP_LOGI(TAG, "WiFi not enabled, cannot start RTP MIDI");
		return;
	}
	else
	{
		if(esp32Info.wifiConnected)
		{
			Serial.print("{\"debug\":{\"address\":\"");
			Serial.print(WiFi.localIP());
			Serial.print("\",\"port\":");
			Serial.print(RTP.getPort());
			Serial.print(",\"name\":\"");
			Serial.print(RTP.getName());
			Serial.print("\"}}~\n");
			rtpMidi.begin(MIDI_CHANNEL_OMNI);
		}
		else
		{
			//Serial.println("WiFi not connected, cannot start RTP MIDI");
		}
	}
}
#endif



void midi_ReadAll()
{
	// USBD
#ifdef USE_USBD_MIDI
	// Thru routing
	if(usbdMidi.read() && usbdMidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(usbdMidiThruHandlesPtr, usbdMidi.getType(), usbdMidi.getChannel(), usbdMidi.getData1(), usbdMidi.getData2());
	}
#endif
	// USBH
#ifdef USE_USBH_MIDI
	// Thru routing
	if(usbhMidi.read() && usbhMidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(usbhMidiThruHandlesPtr, usbhMidi.getType(), usbhMidi.getChannel(), usbhMidi.getData1(), usbhMidi.getData2());
	}
#endif

	// BLE
#ifdef USE_BLE_MIDI
	if(esp32ConfigPtr->wirelessType == Esp32BLE && !blockWirelessMidi)
	{
		if(esp32ConfigPtr->bleMode == Esp32BLEServer)
		{
			// Thru routing
			if(blueMidi.read() && bleMidiThruHandlesPtr != NULL)
			{
				midi_HandleThruRouting(bleMidiThruHandlesPtr, blueMidi.getType(), blueMidi.getChannel(), blueMidi.getData1(), blueMidi.getData2());
			}
		}
#ifdef USE_BLE_MIDI_CLIENT
		else
		{
			// Thru routing
			if(blueMidiClient.read() && bleMidiThruHandlesPtr != NULL)
			{
				midi_HandleThruRouting(bleMidiThruHandlesPtr, blueMidiClient.getType(), blueMidiClient.getChannel(), blueMidiClient.getData1(), blueMidiClient.getData2());
			}
		}
#endif
	
