samspencer5991/esp32-manager/Src/midi_handling.cpp
	}
#endif
	// WiFi RTP
#ifdef USE_WIFI_RTP_MIDI
	if(esp32ConfigPtr->wirelessType == Esp32WiFi && esp32Info.wifiConnected && !blockWirelessMidi)
	{
		// Thru routing
		if(rtpMidi.read() && wifiMidiThruHandlesPtr != NULL)
		{
			midi_HandleThruRouting(wifiMidiThruHandlesPtr, rtpMidi.getType(), rtpMidi.getChannel(), rtpMidi.getData1(), rtpMidi.getData2());
		}
	
	}
#endif

	// Serial0
#ifdef USE_SERIAL0_MIDI
	// Thru routing
	if(serial0Midi.read() && serial0MidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(serial0MidiThruHandlesPtr, serial0Midi.getType(), serial0Midi.getChannel(), serial0Midi.getData1(), serial0Midi.getData2());
	}
#endif
	// Serial1
#ifdef USE_SERIAL1_MIDI
	// Thru routing
	if(serial1Midi.read() && serial1MidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(serial1MidiThruHandlesPtr, serial1Midi.getType(), serial1Midi.getChannel(), serial1Midi.getData1(), serial1Midi.getData2());
	}
#endif
	// Serial2
#ifdef USE_SERIAL2_MIDI
	// Thru routing
	if(serial2Midi.read() && serial2MidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(serial2MidiThruHandlesPtr, serial2Midi.getType(), serial2Midi.getChannel(), serial2Midi.getData1(), serial2Midi.getData2());
	}
#endif
}

void midi_HandleThruRouting(uint8_t* interfacePtr, MidiType type, Channel channel, DataByte data1, DataByte data2)
{
	#ifdef USE_USBD_MIDI
	if(interfacePtr[MidiUSBD] == 1)
	{
		usbdMidi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_USBH_MIDI
	if(interfacePtr[MidiUSBH] == 1)
	{
		usbhMidi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_BLE_MIDI
	if(interfacePtr[MidiBLE] == 1)
	{
		blueMidi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_WIFI_RTP_MIDI
	if(interfacePtr[MidiWiFiRTP] == 1)
	{
		rtpMidi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_SERIAL0_MIDI
	if(interfacePtr[MidiSerial0] == 1)
	{
		serial0Midi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_SERIAL1_MIDI
	if(interfacePtr[MidiSerial1] == 1)
	{
		serial1Midi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_SERIAL2_MIDI
	if(interfacePtr[MidiSerial2] == 1)
	{
		serial2Midi.send(type, channel, data1, data2);
	}
#endif
}

// Global MIDI callback assignment functions
void midi_AssignControlChangeCallback(void (*callback)(MidiInterfaceType interface, uint8_t channel, uint8_t number, uint8_t value))
{
	mControlChangeCallback = callback;
}

void midi_AssignProgramChangeCallback(void (*callback)(MidiInterfaceType interface, uint8_t channel, uint8_t number))
{
	mProgramChangeCallback = callback;
}

void midi_AssignSysemExclusiveCallback(void (*callback)(MidiInterfaceType interface, uint8_t* array, unsigned size))
{
	mSystemExclusiveCallback = callback;
}

void midi_AssignPetalControlChangeCallback(void (*callback)(MidiInterfaceType interface, uint8_t channel, uint8_t number, uint8_t value))
{
	mPetalControlChangeCallback = callback;
}

void midi_AssignPetalProgramChangeCallback(void (*callback)(MidiInterfaceType interface, uint8_t channel, uint8_t number))
{
	mPetalProgramChangeCallback = callback;
}

void midi_AssignPetalSysemExclusiveCallback(void (*callback)(MidiInterfaceType interface, uint8_t* array, unsigned size))
{
	mPetalSystemExclusiveCallback = callback;
}

void midi_SendDeviceApiSysExString(const char* array, unsigned size, uint8_t containsFraming)
{
#ifdef USE_USBD_MIDI
	if(sysExLastReceptionType == MidiUSBD)
	{
		usbdMidi.sendSysEx(size, (uint8_t*)array, containsFraming);
		return;
	}
#endif

#ifdef USE_BLE_MIDI
	if(sysExLastReceptionType == MidiBLE)
	{
		blueMidi.sendSysEx(size, (uint8_t*)array, containsFraming);
		return;
	}
#endif

#ifdef USE_WIFI_RTP_MIDI
	else if(sysExLastReceptionType == MidiWiFiRTP)
	{
		const char testArray[] = {0xF0, 0x00, 0x22, 0x33, 0x01, 0x02, 0x03, 0x04, 0x05, 0xF7};
		rtpMidi.sendSysEx(10, (uint8_t*)testArray, 1);
		rtpMidi.sendSysEx(size, (uint8_t*)array, containsFraming);
		for(int i=0; i<size; i++)
		{
			Serial.printf("%02X ", array[i]);
		}
		Serial.println();
		//usbdMidi.sendSysEx(size, (uint8_t*)array, containsFraming);
	}
#endif
}

// Petal integration specific functions. These are typically called by the Petal execution
void midi_SendPetalSysEx(const uint8_t* data, size_t size)
{

}

void midi_SendPetalControlChange(uint8_t channel, uint8_t number, uint8_t value)
{

}

void midi_SendPetalProgramChange(uint8_t channel, uint8_t number)
{

}

void midi_SendControlChange(MidiInterfaceType interface, uint8_t channel, uint8_t number, uint8_t value)
{
#ifdef USE_USBD_MIDI
	if(interface == MidiUSBD)
		usbdMidi.sendControlChange(channel, number, value);
#endif
#ifdef USE_USBH_MIDI
	if(interface == MidiUSBH)
		usbhMidi.sendControlChange(channel, number, value);
#endif
#ifdef USE_BLE_MIDI
	if(interface == MidiBLE)
		blueMidi.sendControlChange(channel, number, value);
#endif
#ifdef USE_WIFI_RTP_MIDI
	if(interface == MidiWiFiRTP)
		rtpMidi.sendControlChange(channel, number, value);
#endif
#ifdef USE_SERIAL0_MIDI
	if(interface == MidiSerial0)
		serial0Midi.sendControlChange(channel, number, value);
#endif
#ifdef USE_SERIAL1_MIDI
	if(interface == MidiSerial1)
		serial1Midi.sendControlChange(channel, number, value);
#endif
#ifdef USE_SERIAL2_MIDI
	if(interface == MidiSerial2)
		serial2Midi.sendControlChange(channel, number, value);
#endif
}

// Process SysEx data received on any interface.
void processSysEx(MidiInterfaceType interface, uint8_t* array, unsigned size)
{
	// If this is the first SysEx packet received in the reception
	if(array[0] == SYSEX_START)
	{
		// Check for a valid received address
		if(array[1] == SYSEX_ADDRESS_BYTE1 &&
			array[2] == SYSEX_ADDRESS_BYTE2 &&
			array[3] == SYSEX_ADDRESS_BYTE3)
		{
			receivedSysExAddress = 1;
			if(array[4] == SYSEX_DEVICE_API_COMMAND)
				sysExCommand = SysExDeviceApi;
			else if(array[4] == SYSEX_PETAL_COMMAND)
				sysExCommand = SysExPetal;
			else
				sysExCommand = SysExGeneral;

			// For non-general SysEx receptions
			if(sysExCommand != SysExGeneral)
			{
				sysExRxLock = interface;
				// Copy the received SysEx address to the buffer
				// The start/end, address, and command bytes are not copied
				memcpy(&sysExBuffer[0], &array[5], size-6);
				sysExBufferIndex = size-6;
			}
		}
		else
		{
			sysExRxLock = MidiNone;
			sysExCommand = SysExGeneral;
		}
		if(array[size-1] == SYSEX_END)
		{
			sysExRxComplete = 1;
			sysExLastReceptionType = sysExRxLock;
			sysExRxLock = MidiNone;
		}
	}
	// Continuation of existing reception
	else if(array[0] == SYSEX_END)
	{
		// For non-general SysEx receptions
		if(sysExCommand != SysExGeneral)
		{
			// Copy the received SysEx address to the buffer
			// The start/end, address, and command bytes are not copied
			memcpy(&sysExBuffer[sysExBufferIndex], &array[5], size-2);
			sysExBufferIndex += size-2;
		}
		if(array[size-1] == SYSEX_END)
		{
			sysExRxComplete = 1;
			sysExLastReceptionType = sysExRxLock;
			sysExRxLock = MidiNone;
		}
	}
	if(sysExRxComplete)
	{
		Serial.printf("SysEx Complete with %d bytes with command type %d on port %d \n", sysExBufferIndex, sysExCommand, interface);
		if(sysExCommand == SysExDeviceApi)
		{
			deviceApi_Handler((char*)sysExBuffer, MIDI_TRANSPORT);
		}
		else if(sysExCommand == SysExPetal)
		{

